# 1 Арифметичні операції:
# Написати програму, яка зчитує два числа та виводить їхню суму, різницю, добуток та частку.
print()
print("Задача №1")
print()
variable_1 = 10
variable_2 = 7
print("Перше число",variable_1)
print("Друге число",variable_2)
print()
print("Сума:",variable_1 + variable_2)
print("Різниця:",variable_1 - variable_2)
print("Добуток:",variable_1 * variable_2)
print("Частка:",variable_1 / variable_2)

print("----------------------------------------")
print()

# 2 Залишок від ділення:
# Користувач вводить два числа. Вивести залишок від ділення першого числа на друге.
print("Задача №2")
print()
print("Перше число",variable_1)
print("Друге число",variable_2)
print()
print("Залишок від ділення першого числа на друге:",variable_1 % variable_2)

print("----------------------------------------")
print()

# 3 Цілочисельне ділення:
# Користувач вводить два числа. Вивести, скільки разів перше число ділиться на друге без залишку.
print("Задача №3")
print()
print("Перше число",variable_1)
print("Друге число",variable_2)
print()
print("Скільки разів перше число ділиться на друге без залишку:",variable_1 // variable_2)

print("----------------------------------------")
print()


