# 1 Арифметичні операції:
# Написати програму, яка зчитує два числа та виводить їхню суму, різницю, добуток та частку.
print()
print("Задача №1")
print()
variable_1 = 10
variable_2 = 7
print("Перше число",variable_1)
print("Друге число",variable_2)
print()
print("Сума:",variable_1 + variable_2)
print("Різниця:",variable_1 - variable_2)
print("Добуток:",variable_1 * variable_2)
print("Частка:",variable_1 / variable_2)
print("----------------------------------------")
print()
# 2 Залишок від ділення:
# Користувач вводить два числа. Вивести залишок від ділення першого числа на друге.
print("Задача №2")
print()
print("Перше число",variable_1)
print("Друге число",variable_2)
print()
print("Залишок від ділення першого числа на друге:",variable_1 % variable_2)
print("----------------------------------------")
print()
# 3 Цілочисельне ділення:
# Користувач вводить два числа. Вивести, скільки разів перше число ділиться на друге без залишку.
print("Задача №3")
print()
print("Перше число",variable_1)
print("Друге число",variable_2)
print()
print("Скільки разів перше число ділиться на друге без залишку:",variable_1 // variable_2)
print("----------------------------------------")
print()
# 4 Перетворення стрічки у число:
# Користувач вводить рядок, який складається з цифр. Програма повинна перетворити його на число та вивести.
print("Задача №4")
print()
year = int(input("Введіть свій рік народження - "))
print(year)
print(type(year))
print("----------------------------------------")
print()
# 5 Стрічкова конкатенація + математика:
# Користувач вводить два числа. Програма повинна вивести два прінти: перший — їхню суму,
# другий об'єднати їх. Якщо в нас числа 5 та 4, то результат повинен бути 9 та 54.
print("Задача №5")
print()
number_1 = input("Введіть перше число - ")
number_2 = input("Введіть друге число - ")
print(int(number_1) + int(number_2))
print(number_1 + number_2)
print("----------------------------------------")
print()
# 6 Вік користувача:
# Запитати у користувача його рік народження, ім'я та який зараз рік (три змінні)
# та вивести на екран два прінти: ім'я та скільки років користувачу.
print("Задача №6")
print()
number_1 = input("Введіть свій рік народження - ")
number_2 = input("Введіть своє ім'я - ")
number_3 = input("Введіть який зараз рік - ")
print()
print("Ваше ім'я - ",number_2)
print("Ваш вік - ",int(number_3) - int(number_1),"років")
print("----------------------------------------")
print()


