print("Задача 1")
print("Напишіть програму яка запитує в користувача вартість покупок, він їх вводе через пробіл, точна кількість\n"
      "не вказана. Вам потрібно до вартості покупок додати 6,5 відсотки податків.\n"
      "Потім питаєте чи є в користувача купон на знижку, якщо є то питаєте це на суму чи на відсоток і потім\n"
      "віднімаєте суму або відсоток відповідно від ціни яку отримали раніше і пишете користувачу кінцеву суму.")
print("* завдання з зірочкою не впливає на бал. Округліть суму якщо копійок більше ніж 44 то це буде + 1 гривня,\n"
      "якщо менше. то тоді просто відкидаємо копійки від ціни.")
print()
var_1 = input("Введіть будь ласка вартість покупок через пробіл(копійки вводимо через крапку):\n")
list_1 = var_1.split()
list_2 = []
for element in list_1:
    element = float(element)
    list_2.append((element * 6.5) / 100 + element)
final_price = sum(list_2)
var_2 = input("Підкажіть у Вас є купон на знижку?(так - 1, ні - 2) - ")
if var_2 == '2':
    print("Сума до сплати - ", final_price)
    print()
else:
    var_3 = input("Знижка на суму чи відсоток ?(сума - 1, відсоток - 2) - ")
    if var_3 == '1':
        var_4 = float(input("Вкажіть суму знижки ?(копійки вводимо через крапку) - "))
        final_price = final_price - var_4
        print("Сума до сплати - ", final_price)
    else:
        var_4 = float(input("Вкажіть відсоток знижки ?(знак розділення крапка) - "))
        final_price = final_price - (final_price * var_4) / 100
        print("Сума до сплати - ", final_price)
print()
print("Задача 2")
print(
    "Переробіть задачу з попереднього уроку враховуючи ваші знання з цього уроку, використайте цикл for in або while.")
print()
var_1 = input(
    "Введіть будь ласка через пробіл товари, що Ви плануєте купити (не менше 5 товарів, тільки літери):\n")
list_1 = var_1.split()
if len(list_1) < 5:
    print("Вибачте! Товарів менше п'яти.")
else:
    print("Зараз в кошику: ", list_1)
    n = 0
    while n < 5:
        n += 1
        var_2 = int(input("Введіть порядковий номер товару , який ви вже купили: "))
        list_1.pop(var_2 - 1)
        print("В кошику лишилось -", list_1)
    print()
    if len(list_1) == 0:
        print("Вітаю Ви купили все, що планували!\n")
    else:
        print("В кошику ще лишились товари: ", list_1)
    print()
    var_3 = input("Бажаєте додати ще товар (наберіть так чи ні)? - ")
    if var_3 == "так":
        var_4 = input("Введіть будь ласка товари, що Ви плануєте купити(тільки літери):\n")
        list_2 = var_4.split()
        list_1.extend(list_2)
        print("Наразі в кошику:", list_1)
print()
print("Задача 3")
print("Напишіть програму Банкомат. Втсановіть пін код для користувача(зробимо це константою).\n"
      "Запитайте в користувача Пін якщо він введе три рази не вірно то напишіть що карта заблокована.\n"
      "Використовуйте цикл while.")
print()
print("Програма 'Банкомат'")
pin_code = 9745
n = 0
while n < 3:
    n += 1
    var = int(input("Введіть будь ласка ПІН-код:"))
    if var != pin_code:
        print("ПІН-код не вірний!")
        if n == 3:
            print("Вашу карту заблоковано!")
    else:
        print("ПІН-код вірний!")
        break
print()
print("Задача 4")
print("Напишіть за допомогою f-string та format.Дві стрічки де буде підставлятись імя та вік з зміних\n"
      "name = 'оЛенА'\n"
      "age = 21\n"
      "f_string = тут ваш код формата ф-стрінг. | повино вийти -> Я Олена, мені 21 рік\n"
      "format_string = тут ваш код формата формат стрінг | повино вийти -> Я Олена, мені 21 рік\n"
      "print(f_string)\n"
      "print(format_string)")
print()
name = 'оЛенА'
name = name.title()
age = 21
f_string = f"Я {name}, мені {age} рік."
format_string = """Я {0}, мені {1} рік.""".format(name, age)
print(f_string)
print(format_string)
print()
finish = input("Натисніть ENTER для завершення роботи.")
print(finish)
