print("Задача 1")
print("Напишіть програму яка запитує в користувача вартість покупок, він їх вводе через пробіл, точна кількість\n"
      "не вказана. Вам потрібно до вартості покупок додати 6,5 відсотки податків.\n"
      "Потім питаєте чи є в користувача купон на знижку, якщо є то питаєте це на суму чи на відсоток і потім\n"
      "віднімаєте суму або відсоток відповідно від ціни яку отримали раніше і пишете користувачу кінцеву суму.")
print("* завдання з зірочкою не впливає на бал. Округліть суму якщо копійок більше ніж 44 то це буде + 1 гривня,\n"
      "якщо менше. то тоді просто відкидаємо копійки від ціни.")
print()
print("Задача 2")
print("Переробіть задачу з попереднього уроку враховуючи ваші знання з цього уроку, використайте цикл for in або while")
print()
print("Задача 3")
print("Напишіть програму Банкомат. Втсановіть пін код для користувача(зробимо це константою).\n"
      "Запитайте в користувача Пін якщо він введе три рази не вірно то напишіть що карта заблокована.\n"
      "Використовуйте цикл while.")
print()
print("Програма 'Банкомат'")
pin_code = 9745
n = 0
while n < 3:
    n += 1
    var = int(input("Введіть будь ласка ПІН-код:"))
    if var != pin_code:
        print("ПІН-код невірний!")
print()
print("Вашу карту заблоковано!")
print()
print("Задача 4")
print("Напишіть за допомогою f-string та format.Дві стрічки де буде підставлятись імя та вік з зміних\n"
      "name = 'оЛенА'\n"
      "age = 21\n"
      "f_string = тут ваш код формата ф-стрінг. | повино вийти -> Я Олена, мені 21 рік\n"
      "format_string = тут ваш код формата формат стрінг | повино вийти -> Я Олена, мені 21 рік\n"
      "print(f_string)\n"
      "print(format_string)")
print()
name = 'оЛенА'
name = name.title()
age = 21
f_string = f"Я {name}, мені {age} рік."
format_string = """Я {0}, мені {1} рік.""".format(name, age)
print(f_string)
print(format_string)
print()
finish = input("Натисніть ENTER для завершення роботи.")
print(finish)
