print("Задача №1.\n"
      "Створіть клас Студент, в ньому обявіть дві змінні імя де збережети імя студента, та список його оцінок.\n"
      "створіть два метода в цьому класі, перший метод який буде вітатись і при вітання використовувати імя студента.\n"
      "другий метод буде виводити оцінки. Методи виводять результат через прінти.\n"
      "\n"
      "Створіть два екземпляра цього класу, в другому екземплярі змніть імя на своє(не міняючи нічого в класі).\n"
      "Вивідіть дві функції цих екземплярів, що б кожен студент привітався та сказав свої оцінки.\n")

print("Виконання:\n")


class StudentClass:
    name = "Степан"
    rating = (5, 5, 1, 2, 3, 1)

    def stud_name(self):
        self.my_name = f"Привіт, мене звати {self.name}."
        print(self.my_name)

    def stud_rating(self):
        self.my_rating = f"Мої оцінки: {self.rating}"
        print(self.my_rating)


obj_1 = StudentClass()
obj_1.stud_name()
obj_1.stud_rating()

print()

obj_2 = StudentClass()
obj_2.name = "Юрій"
obj_2.rating = (4, 5, 3, 5, 4, 3)
obj_2.stud_name()
obj_2.stud_rating()
print()

print("Задача №2.\n"
      "Напишіть 5 тестів з затримкою в 2 секунди кожен, один з тестів повинен мати унікальне імя.\n"
      "Запустіть їх за домогою pytest-xdist ліби в 5 потоків. Запустіть цей ваш унікальний тест з маркером -k\n"
      "додайте скірншоти виконання(не забудьте додавати -v, що б я бачив що ви проганяли) і біля скріншотів пропишіть\n"
      "команди які ви використовували.\n")
print("Виконання: - ранимо тести test_lesson_11.py в терміналі, результати на скрінах доданих до здачі\n")
print()

print("Задача №3.\n"
      "Обновіть requirements.txt\n")
print("Виконання: - https://github.com/YUROGOR/Hillel_october_23/blob/main/requirements.txt")
